Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The Resident Set Size (RSS) memory usage is much smaller compared to a regular JVM application.
ja_jp: Resident Set Size (RSS) メモリ使用量は、通常の JVM アプリケーションと比較してはるかに小さくなります。

source: The Runtime module
ja_jp: 実行時モジュール

source: The RuntimeValue is useful if the log is only available at runtime. If you can get the log in the deployment module you can use the supplier.
ja_jp: `RuntimeValue` は、ログが実行時にのみ利用可能な場合に便利です。デプロイメントモジュールでログを取得できる場合は、サプライヤーを使用できます。

source: The SLF4J adapter is provided by the following dependency:
ja_jp: SLF4J アダプターは、以下の依存関係によって提供されます。

source: The SMTP hostname, port and credentials, and an email address
ja_jp: SMTPホスト名、ポート、資格情報、および電子メール アドレス

source: The STM subsystem needs to be told about which objects it should be managing. The Quarkus (aka Narayana) STM implementation does this by providing containers of transactional memory within which these object instances reside. Until an object is placed within one of these STM containers it cannot be managed within transactions and any state changes will not possess the A, C, I (or even D) properties.
ja_jp: STM サブシステムは、どのオブジェクトを管理すべきかを伝える必要があります。Quarkus (別名 Narayana) の STM 実装は、これらのオブジェクトインスタンスが存在するトランザクションメモリーのコンテナーを提供することでこれを行います。オブジェクトがこれらの STM コンテナー内に置かれるまでは、トランザクション内で管理することはできず、状態の変更は A、C、I (あるいは D) のプロパティーを持たないことになります。

source: The Scenario
ja_jp: シナリオ

source: The September Newsletter has been published! This month, check out great articles about Eric Deandrea's new book "Quarkus for Spring Developers", RESTEasy reactive, and the use of "Quarkus Security OPENID Connect Multi Tenacy".
ja_jp: 9月のニュースレターが発行されました!今月は、Eric Deandrea氏の新刊「Quarkus for Spring Developers」、RESTEasy reactive、「Quarkus Security OPENID Connect Multi Tenacy」の利用についての素晴らしい記事をご覧ください。

source: The Service Binding Operator completes the following actions:
ja_jp: Service Binding Operator は、以下の操作を実施します。

source: The Service Binding Operator responsible for the binding process then reads the information from the `ServiceBinding` resource and mounts the required files to a container accordingly.
ja_jp: バインディングプロセスを担当する Service Binding Operator は、`ServiceBinding` リソースから情報を読み取り、それに応じて必要なファイルをコンテナーにマウントします。

source: The Service Binding Operator watches for `ServiceBinding` resources, which inform the Operator what applications are meant to be bound with what services. When a listed application is deployed, the Service Binding Operator collects all the binding information that must be passed to the application, then upgrades the application container by attaching a volume mount with the binding information.
ja_jp: Service Binding Operator は `ServiceBinding` リソースを監視し、どのアプリケーションがどのサービスとバインドされるべきかを Operator に知らせます。リストされたアプリケーションがデプロイされると、Service Binding Operator はアプリケーションに渡さなければならないすべてのバインディング情報を収集し、バインディング情報でボリュームマウントをアタッチしてアプリケーションコンテナーをアップグレードします。

source: The Servlet endpoint
ja_jp: サーブレットエンドポイント

source: The Simplest Example
ja_jp: 最も簡単な例

source: The Single-page application returns the same data to the Quarkus user.
ja_jp: シングルページアプリケーションは、同じデータをQuarkusユーザーに返します。

source: The Single-page application uses Authorization Code Flow to authenticate the user and retrieve tokens from the OpenID Connect provider.
ja_jp: シングルページアプリケーションでは、Authorization Code Flowを使用してユーザーを認証し、OpenID Connectプロバイダーからトークンを取得します。

source: The Single-page application uses the access token to retrieve the service data from the Quarkus service.
ja_jp: シングルページアプリケーションでは、アクセストークンを使用して、Quarkusサービスからサービスデータを取得します。

source: The SmallRye JWT Build API simplifies securing JWT claims by supporting all these options. It uses the link:https://bitbucket.org/b_c/jose4j/wiki/Home[Jose4J] library internally to provide this functionality.
ja_jp: SmallRye JWT Build API は、これらすべてのオプションをサポートすることで、JWT クレームの保護を簡素化します。 この機能を提供するために、内部で link:https://bitbucket.org/b_c/jose4j/wiki/Home[Jose4J] ライブラリーを使用しています。

source: The SockJS bridge provided by Vert.x allows browser applications and Quarkus applications to communicate using the event bus. It connects both sides. So, both sides can send messages received on the other side. It supports the three delivery mechanisms.
ja_jp: Vert.xが提供するSockJSブリッジは、ブラウザアプリケーションとQuarkusアプリケーションがイベントバスを使って通信できるようにします。双方を接続します。そのため、双方が相手側で受信したメッセージを送信することができます。3つの配信メカニズムをサポートしています。

source: The Solution
ja_jp: ソリューション

source: The Spatial extension to Hibernate ORM provides a standardized, cross-database interface to geographic data storage and query functions.
ja_jp: Hibernate ORM の Spatial エクステンションは、地理データの保存およびクエリー機能に対する、標準化されたクロスデータベースインターフェースを提供します。

source: The Stork service name can be found in the _tags_.
ja_jp: Stork のサービス名は _タグ_ に記載されています。

source: The StreamNative Pulsar clusters use Oauth2 authentication, so you need to make sure that a https://docs.streamnative.io/docs/service-account[service account] exists with required https://docs.streamnative.io/docs/access-control#authorize-namespaces[permissions to the Pulsar namespace/topic] your application is using.
ja_jp: StreamNative Pulsar クラスターは Oauth2 認証を使用します。そのため、アプリケーションが使用している https://docs.streamnative.io/docs/access-control#authorize-namespaces[Pulsar namespace/トピックへの権限] を持つ https://docs.streamnative.io/docs/service-account[サービスアカウント] が存在することを確認する必要があります。

source: The Super Hero UI application, shown in Figure 1 above, is an http://angular.io/[Angular^] single-page application deployed via Node.js. It communicates to the Fight service via REST. The focus of the sample application is on the Quarkus applications and not the Angular UI.
ja_jp: 上の図1に示されているSuper Hero UIアプリケーションは、Node.jsを介してデプロイされた link:http://angular.io/[Angular, window=_blank]シングルページアプリケーションです。このアプリケーションは、RESTを介してFightサービスと通信します。サンプルアプリケーションでは、Angular UIではなくQuarkusアプリケーションに焦点を当てています。

source: The Super Heroes UI can be https://github.com/quarkusio/quarkus-super-heroes/tree/main/ui-super-heroes#building-the-application[built and run from source^], but since the focus of this article is Quarkus, we will run it as a container image. Open a new terminal and run `+docker run -p 8080:8080 -e API_BASE_URL=http://localhost:8082 quay.io/quarkus-super-heroes/ui-super-heroes:latest+`.
ja_jp: Super Heroes UIは link:https://github.com/quarkusio/quarkus-super-heroes/tree/main/ui-super-heroes#building-the-application[ソースからビルドして実行する, window=_blank]ことができますが、この記事の焦点はQuarkusなので、コンテナイメージとして実行します。新しいターミナルを開き、 `docker run -p 8080:8080 -e API_BASE_URL=http://localhost:8082 quay.io/quarkus-super-heroes/ui-super-heroes:latest` を実行します。

source: The TCP connection timeout (ms); 0 is interpreted as no timeout Type: _int_
ja_jp: TCP 接続タイムアウト (ミリ秒)。0 はタイムアウトなしとして解釈されます。 Type: _int_

source: The TLS Registry consolidates settings and supports multiple named configurations. Therefore, you can tailor TLS settings for different application parts. This flexibility is particularly useful when different components require distinct security configurations.
ja_jp: TLS レジストリーは設定を統合し、複数の名前付き設定をサポートしています。 したがって、さまざまなアプリケーションパーツに合わせて TLS 設定をカスタマイズできます。 この柔軟性は、各コンポーネントに異なるセキュリティー設定が必要な場合に特に役立ちます。

source: The TLS Registry extension is automatically included in your project when you use compatible extensions, such as Quarkus REST, gRPC, SmallRye GraphQL Client , or Reactive Routes .
ja_jp: Quarkus REST、gRPC、SmallRye GraphQL Client、Reactive Routes などの互換性のあるエクステンションを使用すると、 TLS レジストリーエクステンションがプロジェクトに 自動的に追加されます。

source: The TLS Registry is a Quarkus extension that centralizes TLS configuration, making it easier to manage and maintain secure connections across your application.
ja_jp: TLS レジストリーは、TLS 設定を一元管理する Quarkus エクステンションです。アプリケーション全体のセキュアな接続の管理と保守を容易にします。

source: The TLS Registry is a Quarkus extension that centralizes TLS configuration, making it easier to manage and maintain secure connections across your application. When defining TLS configurations in a single centralized location, you can use the TLS Registry to reference these configurations from multiple components within the application, which ensures consistency and reduces the potential for configuration errors.
ja_jp: TLS レジストリーは、TLS 設定を一元管理する Quarkus エクステンションです。アプリケーション全体のセキュアな接続の管理と保守を容易にします。 TLS 設定を 1 カ所で集中して定義する場合、TLS レジストリーを使用して、アプリケーション内の複数のコンポーネントからこの設定を参照できます。これにより、一貫性が確保され、設定エラーの可能性が軽減されます。

source: The TLS protocol versions are the list of protocols that can be used during the TLS handshake. Enabled TLS protocol versions are specified as an ordered list separated by commas. The relevant configuration property is `quarkus.tls.protocols` (or `quarkus.tls.<name>.protocols` for named TLS configurations). It defaults to `TLSv1.3, TLSv1.2` if not configured.
ja_jp: TLS プロトコルバージョンは、TLS ハンドシェイク中に使用できるプロトコルのリストです。 有効な TLS プロトコルバージョンを、コンマ区切りの順序付きリストとして指定します。 関連する設定プロパティーは `quarkus.tls.protocols` (または 名前付き TLS 設定の `quarkus.tls.<name>.protocols`) です。 設定されていない場合は、デフォルトで `TLSv1.3, TLSv1.2` になります。

source: The TLS protocol versions are the list of protocols that can be used during the TLS handshake. Enabled TLS protocol versions are specified as an ordered list separated by commas. The relevant configuration property is `quarkus.tls.protocols` or `quarkus.tls.<name>.protocols` for named TLS configurations. For improved security, it defaults to `TLSv1.3` unless configured otherwise.
ja_jp: TLS プロトコルバージョンは、TLS ハンドシェイク中に使用できるプロトコルのリストです。有効な TLS プロトコルバージョンは、カンマで区切られた順序付きリストとして指定されます。関連する設定プロパティーは、名前付き TLS 設定の場合、`quarkus.tls.protocols` または `quarkus.tls.<name>.protocols` です。セキュリティー向上のため、特に設定しない限り、デフォルトは `TLSv1.3` になります。

source: The TLS protocol versions are the list of protocols that can be used during the TLS handshake. Enabled TLS protocol versions are specified as an ordered list separated by commas. The relevant configuration property is `quarkus.tls.protocols` or `quarkus.tls.<name>.protocols` for named TLS configurations. It defaults to `TLSv1.3, TLSv1.2` if not configured.
ja_jp: TLS プロトコルバージョンは、TLS ハンドシェイク中に使用できるプロトコルのリストです。 有効な TLS プロトコルバージョンを、コンマ区切りの順序付きリストとして指定します。 関連する設定プロパティー、`quarkus.tls.protocols` または 名前付き TLS 設定の `quarkus.tls.<name>.protocols` です。 設定されていない場合は、デフォルトで `TLSv1.3, TLSv1.2` になります。

source: The TLS provider used by an internal client to authenticate with other Pulsar brokers.
ja_jp: 内部クライアントが他のPulsarブローカーとの認証に使用するTLSプロバイダー。

source: The TLS registry can manage the challenge process from either the main HTTP interface or the management interface. Using a management interface is **strongly** recommended to let Quarkus deal with ACME challenge configuration separately from the main application's deployment and security requirements:
ja_jp: TLS レジストリーは、メイン HTTP インターフェイスまたは管理インターフェイスのいずれかからチャレンジプロセスを管理できます。 メインアプリケーションのデプロイメントとセキュリティーの要件とは別に、Quarkus が ACME チャレンジ設定を処理できるように、管理インターフェイスを使用することが **強く** 推奨されます。

source: The TLS registry can manage the challenge process from either the main HTTP interface or the management interface. Using a management interface is **strongly** recommended to let Quarkus deal with the ACME challenge configuration separately from the main application's deployment and security requirements:
ja_jp: TLS レジストリーは、メイン HTTP インターフェイスまたは管理インターフェイスのいずれかからチャレンジプロセスを管理できます。Quarkus がメインアプリケーションのデプロイメントやセキュリティー要件とは別に ACME チャレンジ設定を処理できるように、管理インターフェイスを使用することを **強く** 推奨します。

source: The TLS registry extension allows a CLI ACME client to issue and renew Let's Encrypt certificates. Your application uses this TLS registry extension to resolve ACME protocol challenges.
ja_jp: TLS レジストリーエクステンションにより、CLI ACME クライアントは Let's Encrypt 証明書を発行および更新できるようになります。 アプリケーションは、この TLS レジストリーエクステンションを使用して、ACME プロトコルのチャレンジを解決します。

source: The TLS registry includes a built-in mechanism for periodically checking the file system for changes and reloading certificates. The `reload-period` property specifies the interval for reloading certificates and emits a `CertificateUpdatedEvent` each time certificates are reloaded.
ja_jp: TLS レジストリーには、ファイルシステムの変更を定期的にチェックし、証明書を再読み込みするためのメカニズムが組み込まれています。 `reload-period` プロパティーは、証明書をリロードする間隔を指定し、証明書がリロードされるたびに `CertificateUpdatedEvent` を発行します。

source: The TLS registry includes a built-in mechanism that periodically checks the file system for changes and reloads certificates. The `reload-period` property specifies the interval for reloading certificates and emits a `CertificateUpdatedEvent` each time certificates are reloaded.
ja_jp: TLS レジストリーには、ファイルシステムの変更を定期的にチェックし、証明書を再読み込みする組み込みメカニズムが含まれています。`reload-period` プロパティーは証明書を再読み込みする間隔を指定し、証明書が再読み込みされるたびに `CertificateUpdatedEvent` を発生させます。

source: The TLS registry provides Quarkus CLI commands to generate a development Certificate Authority (CA) and trusted certificates. This avoids having to use self-signed certificates locally.
ja_jp: TLS レジストリーは、開発用認証局 (CA) と信頼済み証明書を生成するための Quarkus CLI コマンドを備えています。 これにより、自己署名証明書をローカルで使用する必要がなくなります。

source: The Temperature Value Producer
ja_jp: 温度値プロデューサー

source: The Total RSS (kB) line reports the total native memory the process is using.
ja_jp: Total RSS (kB)の行は、プロセスが使用しているネイティブメモリの合計を報告します。

source: The TrustStore path
ja_jp: TrustStoreのパス

source: The UBI minimal image is bigger than the micro one mentioned above. It contains more utilities such as the `microdnf` package manager.
ja_jp: UBI の最小イメージは、上記のマイクロイメージよりも大きくなっています。これには、 `microdnf` パッケージマネージャーなどのユーティリティーが含まれています。

source: The UI is now fully branded:
ja_jp: UIは完全にブランド化されています:

source: The UPX compression requires:
ja_jp: UPX圧縮には、以下のような条件があります。

source: The URI must be registered as a valid `post_logout_redirect_uri` in the OIDC provider.
ja_jp: この URI は、OIDC プロバイダーで有効な `post_logout_redirect_uri` として登録されている必要があります。

source: The URL can be updated during the deployment or at launch time using system properties or environment variables. You can even use https://quarkus.io/guides/stork[service discovery and selection]. Quarkus is not limited to HTTP. You can use https://quarkus.io/guides/grpc-getting-started[gRPC] or https://quarkus.io/guides/smallrye-graphql[GraphQL], two prominent alternatives in the microservice space.
ja_jp: URL は、システム プロパティーまたは環境変数を使用して、デプロイ中または起動時に更新できます。 https://quarkus.io/guides/stork[サービスの検出と選択] を使用することもできます。 Quarkus は HTTP に限定されません。 マイクロサービス分野では、 https://quarkus.io/guides/grpc-getting-started[gRPC] または https://quarkus.io/guides/smallrye-graphql[GraphQL] という 2 つの主要な代替手段を使用できます。

source: The URL can now be updated during the deployment or at launch time using system properties or environment variables.
ja_jp: システムプロパティや環境変数を使って、デプロイ時や起動時にURLを更新できるようになりました。

source: The URL macro also supports https://docs.asciidoctor.org/asciidoc/latest/macros/link-macro-ref/[additional attributes] that may be relevant, like opening a link in a different window.
ja_jp: URL マクロは、リンクを別ウィンドウで開くなどの関連性が考えられる https://docs.asciidoctor.org/asciidoc/latest/macros/link-macro-ref/[追加属性] もサポートしています。

source: The URL macro also supports link:https://docs.asciidoctor.org/asciidoc/latest/macros/link-macro-ref/[additional attributes] that may be relevant, like opening a link in a different window.
ja_jp: URLマクロは、リンクを別ウィンドウで開くなど、関連しそうな link:https://docs.asciidoctor.org/asciidoc/latest/macros/link-macro-ref/[追加属性] もサポートしています。

source: The URL path to execute a function is the function name. For example if your function name is `foo` then the URL path to execute the function would be `/foo`.
ja_jp: Function を実行するための URL パスは、Function 名です。例えば、Function 名が `foo` の場合、Function を実行する URL パスは `/foo` になります。

source: The URL that your app is going to be running in dev mode at. This is only needed on the local side, so you may want to leave it out of the properties file and specify it as a system property on the command line.
ja_jp: アプリがdevモードで実行されるURL。これはローカル側でのみ必要なので、プロパティー ファイルから除外して、コマンド ラインでシステム プロパティーとして指定するとよいでしょう。

source: The URL to access the example would be:
ja_jp: 例題にアクセスするためのURLは次のようになります:

source: The URL to access the service would be
ja_jp: サービスにアクセスするためのURLは次のようになります。

source: The URL to access the service would be something like
ja_jp: サービスにアクセスするための URL は次のようになります。

source: The URL to access the service would be something like: `https://{appName}.azurewebsites.net/api/hello`.
ja_jp: サービスにアクセスするための URL は次のようになります: `https://{appName}.azurewebsites.net/api/hello`.

source: The URL to access the service would be: `https://{appName}.azurewebsites.net/api/HttpExample`
ja_jp: サービスにアクセスするための URL は次のようになります: `https://{appName}.azurewebsites.net/api/HttpExample`

source: The URL used by our test resource. Tests may leverage `LdapServerTestResource` provided by Quarkus as link:{quickstarts-blob-url}/security-ldap-quickstart/src/test/java/org/acme/elytron/security/ldap/ElytronLdapExtensionTestResources.java[we do] in the test coverage of the example application.
ja_jp: テストリソースが使用する URL。テストは、サンプルアプリケーションのテストカバレッジで link:{quickstarts-blob-url}/security-ldap-quickstart/src/test/java/org/acme/elytron/security/ldap/ElytronLdapExtensionTestResources.java[行っている] ように、Quarkus が提供する `LdapServerTestResource` を活用することができます。

source: The URL used by our test resource. Tests may leverage `LdapServerTestResource` provided by Quarkus as {quickstarts-blob-url}/security-ldap-quickstart/src/test/java/org/acme/elytron/security/ldap/ElytronLdapExtensionTestResources.java[we do] in the test coverage of the example application.
ja_jp: テストリソースが使用するURLです。サンプルアプリケーションでのテスト範囲では、テストはQuarkusが {quickstarts-blob-url}/security-ldap-quickstart/src/test/java/org/acme/elytron/security/ldap/ElytronLdapExtensionTestResources.java として提供する `LdapServerTestResource` を活用できます。

source: The URLs of Reactive datasources that are used by the `quarkus-security-jpa-reactive` extension are set with the `quarkus.datasource.reactive.url` configuration property and not the `quarkus.datasource.jdbc.url` configuration property typically used by JDBC datasources.
ja_jp: `quarkus-security-jpa-reactive` エクステンションによって使用される Reactive データソースの URL は、JDBC データソースで通常使用される `quarkus.datasource.jdbc.url` 設定プロパティーではなく、 `quarkus.datasource.reactive.url` 設定プロパティーで設定されます。

source: The Vale linter job automatically runs when a PR is created or updated. If your content updates do not align with the key style or terminology preferences of the Quarkus community, the updated line on the diff tab gets annotated with the Vale recommendations. To ensure that your content gets approved, fix the linter errors, warnings, and suggestions.
ja_jp: PRが作成または更新されると、Valeのリンタージョブが自動的に実行されます。コンテンツの更新がQuarkusコミュニティの主要なスタイルや用語の好みと一致しない場合、diffタブの更新行にValeの推奨事項の注釈が付きます。コンテンツが承認されるように、リンターのエラー、警告、および提案を修正してください。

source: The Vault Dev Service will be enabled when the `quarkus-vault` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the link:{vault-guide}#dev-services[Vault Guide].
ja_jp: Vault Dev Service は、アプリケーションに `quarkus-vault` エクステンションが存在し、サーバー アドレスが明示的に設定されていない場合に有効になります。詳細については、 link:{vault-guide}#dev-services[Vaultガイド]を参照してください。

source: The Vault Dev Service will be enabled when the `quarkus-vault` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the link:{vault-guide}#dev-services[Vault Guide].
ja_jp: Vault Dev Service は、アプリケーションに `quarkus-vault` エクステンションが存在し、サーバー アドレスが明示的に設定されていない場合に有効になります。詳細については、 link:{vault-guide}#dev-services[Vaultガイド]を参照してください。

source: The Vert.x "bare" API and friends
ja_jp: Vert.xの「素の」APIとその仲間たち

source: The Vert.x Mutiny API
ja_jp: Vert.x Mutiny API

source: The Vert.x asynchronous file system API does not use io_uring yet.
ja_jp: Vert.xの非同期ファイルシステムAPIは、まだio_uringを使用していません。

source: The Villain service is a blocking HTTP microservice exposing CRUD operations on a `+Villain+` data model. In fact, the `+Villain+` data model is identical to the `+Hero+` data model in the <<hero-service,Hero service>> (other than the table's name). It also implements all the same use cases as the Hero service. The only difference is that the Villain service is blocking, and it uses the https://quarkus.io/guides/hibernate-orm-panache#solution-1-using-the-active-record-pattern[active record pattern^] from https://quarkus.io/guides/hibernate-orm-panache[Quarkus Hibernate ORM with Panache^].
ja_jp: Villainサービスは、 `Villain` データモデルに対するCRUD操作を公開するブロッキングHTTPマイクロサービスです。実際、 `Villain` データモデルは、 link:#hero-service[Heroサービス]の `Hero` データモデルと同一です（テーブルの名前以外は）。また、Heroサービスと同じユースケースをすべて実装しています。唯一の違いは、Villainサービスがブロッキングであることと、 link:https://quarkus.io/guides/hibernate-orm-panache[Quarkus Hibernate ORM with Panache, window=_blank]の link:https://quarkus.io/guides/hibernate-orm-panache#solution-1-using-the-active-record-pattern[active recordパターン, window=_blank]を使用していることです。

source: The WASM boundary provides a clean and safe interface between the two languages.
ja_jp: WASM の境界は、2 つの言語間にクリーンで安全なインターフェースを提供します。

source: The WebAuthn specification requires HTTPS to be used for communication with the server, though some browsers allow `localhost`. If you must use HTTPS in dev mode, you can always use the https://docs.quarkiverse.io/quarkus-ngrok/dev/index.html[quarkus-ngrok] extension.
ja_jp: WebAuthn 仕様では、サーバーとの通信に HTTPS を使用する必要がありますが、 一部のブラウザーでは `localhost` が許可されています。開発モードで HTTPS を使用する必要がある場合は、 https://docs.quarkiverse.io/quarkus-ngrok/dev/index.html[quarkus-ngrok] を常に使用できます。

source: The WebSocket Next extension supports automatic serialization and deserialization of messages.
ja_jp: WebSocket Next エクステンションは、メッセージの自動シリアライゼーションとデシリアライゼーションをサポートします。

source: The WebSocket endpoint can also be notified when a client connects or disconnects.
ja_jp: クライアントが接続または切断したときに、WebSocket エンドポイントに通知することもできます。

source: The WebSocket protocol
ja_jp: WebSocket プロトコル

source: The WireMock extension starts WireMock as a Dev Service. It is a test-focussed extension, designed to run in dev and test mode only. More information can be found in the https://docs.quarkiverse.io/quarkus-wiremock/dev/index.html[WireMock Guide].
ja_jp: WireMockエクステンションは、WireMockをDevサービスとして起動します。テストに特化したエクステンションであり、開発モードとテストモードでのみ実行するように設計されています。 詳細は link:https://docs.quarkiverse.io/quarkus-wiremock/dev/index.html[WireMockガイド] を参照してください。

source: The YAML configuration also support profile aware files. In this case, properties for a specific profile may reside in an `application-{profile}.yaml` named file. The previous example may be expressed as:
ja_jp: YAML設定では、プロファイルのためのファイルにも対応しています。この場合、特定のプロファイルのプロパティは、 `application-{profile}.yaml` という名前のファイルに格納されます。先ほどの例は次のように表現できます。

source: The YAML configuration also supports profile-aware files. In this case, properties for a specific profile can reside in an `application-{profile}.yaml` named file. The previous example can be expressed as:
ja_jp: YAML 設定はプロファイル対応ファイルもサポートします。 この場合、特定のプロファイルのプロパティは `application-{profile}.yaml` という名前のファイルに保存できます。 先程の例は次のように表現できます：

source: The YAML format also supports xref:config-reference.adoc#expressions[expressions], using the same format as Java Properties:
ja_jp: YAMLフォーマットは、Javaプロパティと同じフォーマットを使用した xref:config-reference.adoc#expressions[式] もサポートしています。

source: The YAML format also supports xref:config-reference.adoc#property-expressions[property expressions], by using the same format as Java properties:
ja_jp: YAML フォーマットは Java プロパティと同じフォーマットを使うことで xref:config-reference.adoc#property-expressions[プロパティ式] もサポートします：

source: The YAML format also supports xref:config-reference.adoc#property-expressions[property expressions], using the same format as Java Properties:
ja_jp: YAMLフォーマットは、Javaプロパティと同じフォーマットを使用した xref:config-reference.adoc#property-expressions[プロパティ式] もサポートしています。
